#### Terraform Plan 📋

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_password.jwt_secret: Refreshing state... [id=none]
random_password.baserow_secret: Refreshing state... [id=none]
random_password.docuseal_secret: Refreshing state... [id=none]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san]
module.network.azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san]
module.cognitive.azurerm_cognitive_account.document_intelligence: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.CognitiveServices/accounts/nl-prod-hov-di-san]
module.network.azurerm_network_security_group.database: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/networkSecurityGroups/prod-database-nsg]
module.network.azurerm_network_security_group.containers: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/networkSecurityGroups/prod-container-nsg]
module.network.azurerm_network_security_group.gateway: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/networkSecurityGroups/prod-gateway-nsg]
module.network.azurerm_subnet.database: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-database-subnet]
module.network.azurerm_subnet.gateway: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-gateway-subnet]
module.network.azurerm_subnet.containers: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-container-subnet]
module.network.azurerm_subnet_network_security_group_association.gateway: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-gateway-subnet]
module.network.azurerm_subnet_network_security_group_association.database: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-database-subnet]
module.network.azurerm_subnet_network_security_group_association.containers: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-container-subnet]
module.security.data.azurerm_client_config.current: Reading...
module.security.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zZWFmOTFlNy1lM2Q5LTQ5Y2UtODZjYy03MDMwNjU0MmEzOTE7b2JqZWN0SWQ9NTg5MGJiMTctZjQ3Ny00MGExLWI5MzItODViNmY0YjM2MWMxO3N1YnNjcmlwdGlvbklkPTIyZjllYjE4LTY1NTMtNGI3ZC05NDUxLTQ3ZDAxOTUwODVmZTt0ZW5hbnRJZD03ZWRmNDQyMy1jY2IzLTQyNzUtYmM4MC02NGRhZTNlZjAxNDg=]
module.security.azurerm_key_vault.main: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san]
module.storage.azurerm_storage_account.main: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Storage/storageAccounts/nlprodhovstsan]
module.security.azurerm_key_vault_access_policy.terraform: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san/objectId/5890bb17-f477-40a1-b932-85b6f4b361c1]
module.storage.azurerm_storage_management_policy.lifecycle: Refreshing state... [id=/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Storage/storageAccounts/nlprodhovstsan/managementPolicies/default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.compute.azurerm_container_group.baserow will be created
  + resource "azurerm_container_group" "baserow" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "southafricanorth"
      + name                        = "prod-baserow"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "nl-prod-hov-rg-san"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = [
          + "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-container-subnet",
        ]
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }

      + container {
          + commands                     = (known after apply)
          + cpu                          = 2
          + environment_variables        = (known after apply)
          + image                        = "baserow/baserow:latest"
          + memory                       = 4
          + name                         = "baserow"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 80
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/baserow/data"
              + name                 = "baserow-data"
              + read_only            = false
              + share_name           = "baserow-data"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "nlprodhovstsan"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.compute.azurerm_container_group.docuseal will be created
  + resource "azurerm_container_group" "docuseal" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "southafricanorth"
      + name                        = "prod-docuseal"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "nl-prod-hov-rg-san"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = [
          + "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-container-subnet",
        ]
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }

      + container {
          + commands                     = (known after apply)
          + cpu                          = 2
          + environment_variables        = (known after apply)
          + image                        = "docuseal/docuseal:latest"
          + memory                       = 4
          + name                         = "docuseal"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 3000
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/data"
              + name                 = "docuseal-data"
              + read_only            = false
              + share_name           = "docuseal-data"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "nlprodhovstsan"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.compute.azurerm_key_vault_access_policy.baserow will be created
  + resource "azurerm_key_vault_access_policy" "baserow" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # module.compute.azurerm_key_vault_access_policy.docuseal will be created
  + resource "azurerm_key_vault_access_policy" "docuseal" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # module.compute.azurerm_storage_share.baserow will be created
  + resource "azurerm_storage_share" "baserow" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "baserow-data"
      + quota                = 10
      + resource_manager_id  = (known after apply)
      + storage_account_name = "nlprodhovstsan"
      + url                  = (known after apply)
    }

  # module.compute.azurerm_storage_share.docuseal will be created
  + resource "azurerm_storage_share" "docuseal" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "docuseal-data"
      + quota                = 10
      + resource_manager_id  = (known after apply)
      + storage_account_name = "nlprodhovstsan"
      + url                  = (known after apply)
    }

  # module.database.azurerm_postgresql_flexible_server.main will be created
  + resource "azurerm_postgresql_flexible_server" "main" {
      + administrator_login           = "hov_admin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + delegated_subnet_id           = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-database-subnet"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "southafricanorth"
      + name                          = "nl-prod-hov-pg-san"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "nl-prod-hov-rg-san"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + version                       = "14"
    }

  # module.database.azurerm_postgresql_flexible_server_configuration.log_checkpoints will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "log_checkpoints" {
      + id        = (known after apply)
      + name      = "log_checkpoints"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.database.azurerm_postgresql_flexible_server_configuration.log_connections will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "log_connections" {
      + id        = (known after apply)
      + name      = "log_connections"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.database.azurerm_postgresql_flexible_server_configuration.require_secure_transport will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "require_secure_transport" {
      + id        = (known after apply)
      + name      = "require_secure_transport"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.database.azurerm_postgresql_flexible_server_database.baserow will be created
  + resource "azurerm_postgresql_flexible_server_database" "baserow" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "baserow_production"
      + server_id = (known after apply)
    }

  # module.database.azurerm_postgresql_flexible_server_database.docuseal will be created
  + resource "azurerm_postgresql_flexible_server_database" "docuseal" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "docuseal_production"
      + server_id = (known after apply)
    }

  # module.database.azurerm_private_dns_zone.postgres will be created
  + resource "azurerm_private_dns_zone" "postgres" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "nl-prod-hov-pg-san.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "nl-prod-hov-rg-san"
      + tags                                                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.postgres will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres" {
      + id                    = (known after apply)
      + name                  = "nl-prod-hov-pg-san-vnet-link"
      + private_dns_zone_name = "nl-prod-hov-pg-san.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "nl-prod-hov-rg-san"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + virtual_network_id    = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san"
    }

  # module.dns.data.azurerm_dns_zone.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "main" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "nexamesh.ai"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "nl-prod-nexamesh-rg-san"
      + tags                      = (known after apply)
    }

  # module.dns.azurerm_dns_a_record.docs will be created
  + resource "azurerm_dns_a_record" "docs" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "docs"
      + records             = (known after apply)
      + resource_group_name = "nl-prod-nexamesh-rg-san"
      + tags                = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + ttl                 = 300
      + zone_name           = "nexamesh.ai"
    }

  # module.dns.azurerm_dns_a_record.ops will be created
  + resource "azurerm_dns_a_record" "ops" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ops"
      + records             = (known after apply)
      + resource_group_name = "nl-prod-nexamesh-rg-san"
      + tags                = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + ttl                 = 300
      + zone_name           = "nexamesh.ai"
    }

  # module.dns.azurerm_dns_a_record.root[0] will be created
  + resource "azurerm_dns_a_record" "root" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = (known after apply)
      + resource_group_name = "nl-prod-nexamesh-rg-san"
      + tags                = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + ttl                 = 300
      + zone_name           = "nexamesh.ai"
    }

  # module.functions.azurerm_application_insights.functions will be created
  + resource "azurerm_application_insights" "functions" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "southafricanorth"
      + name                                  = "nl-prod-hov-func-san-insights"
      + resource_group_name                   = "nl-prod-hov-rg-san"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
    }

  # module.functions.azurerm_key_vault_access_policy.functions will be created
  + resource "azurerm_key_vault_access_policy" "functions" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # module.functions.azurerm_linux_function_app.main will be created
  + resource "azurerm_linux_function_app" "main" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "southafricanorth"
      + name                                           = "nl-prod-hov-func-san"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "nl-prod-hov-rg-san"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "nlprodhovfuncstsan"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.11"
              + use_dotnet_isolated_runtime = false
            }

          + cors {
              + allowed_origins     = [
                  + "https://docs.nexamesh.ai",
                  + "https://nexamesh.ai",
                  + "https://ops.nexamesh.ai",
                ]
              + support_credentials = false
            }
        }
    }

  # module.functions.azurerm_service_plan.functions will be created
  + resource "azurerm_service_plan" "functions" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "southafricanorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "nl-prod-hov-func-san-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "nl-prod-hov-rg-san"
      + sku_name                     = "Y1"
      + tags                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + worker_count                 = (known after apply)
    }

  # module.functions.azurerm_storage_account.functions will be created
  + resource "azurerm_storage_account" "functions" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "southafricanorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "nlprodhovfuncstsan"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "nl-prod-hov-rg-san"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
    }

  # module.gateway.azurerm_application_gateway.main will be created
  + resource "azurerm_application_gateway" "main" {
      + id                          = (known after apply)
      + location                    = "southafricanorth"
      + name                        = "prod-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "nl-prod-hov-rg-san"
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = (known after apply)
          + name         = "baserow-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = (known after apply)
          + name         = "docuseal-backend"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "baserow-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "baserow-probe"
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "docuseal-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 3000
          + probe_id                            = (known after apply)
          + probe_name                          = "docuseal-probe"
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "frontend-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http-port"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway-ip-config"
          + subnet_id = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Network/virtualNetworks/nl-prod-hov-vnet-san/subnets/prod-gateway-subnet"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "frontend-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http-port"
          + host_name                      = "docs.nexamesh.ai"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "docuseal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "frontend-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http-port"
          + host_name                      = "ops.nexamesh.ai"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "baserow-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + probe {
          + host                                      = "docs.nexamesh.ai"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "docuseal-probe"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }
      + probe {
          + host                                      = "ops.nexamesh.ai"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "baserow-probe"
          + path                                      = "/api/health/"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "baserow-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "baserow-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "baserow-http-listener"
          + id                         = (known after apply)
          + name                       = "baserow-routing"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "docuseal-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "docuseal-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "docuseal-http-listener"
          + id                         = (known after apply)
          + name                       = "docuseal-routing"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + capacity = 1
          + name     = "WAF_v2"
          + tier     = "WAF_v2"
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Prevention"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.gateway.azurerm_public_ip.gateway will be created
  + resource "azurerm_public_ip" "gateway" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southafricanorth"
      + name                    = "prod-gateway-pip"
      + resource_group_name     = "nl-prod-hov-rg-san"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
    }

  # module.monitoring.azurerm_consumption_budget_resource_group.monthly will be created
  + resource "azurerm_consumption_budget_resource_group" "monthly" {
      + amount            = 1000
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "hov-monthly-budget"
      + resource_group_id = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san"
      + time_grain        = "Monthly"

      + notification {
          + contact_emails = [
              + "hans@nexamesh.ai",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Forecasted"
        }
      + notification {
          + contact_emails = [
              + "hans@nexamesh.ai",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 80
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = (known after apply)
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "southafricanorth"
      + name                            = "nl-prod-hov-law-san"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "nl-prod-hov-rg-san"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + workspace_id                    = (known after apply)
    }

  # module.monitoring.azurerm_monitor_action_group.alerts will be created
  + resource "azurerm_monitor_action_group" "alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "nl-prod-hov-law-san-alerts"
      + resource_group_name = "nl-prod-hov-rg-san"
      + short_name          = "HOVAlerts"
      + tags                = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }

      + email_receiver {
          + email_address = "hans@nexamesh.ai"
          + name          = "admin"
        }
    }

  # module.monitoring.azurerm_monitor_metric_alert.db_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_cpu" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db-cpu-high"
      + resource_group_name      = "nl-prod-hov-rg-san"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.monitoring.azurerm_monitor_metric_alert.function_failures[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_failures" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "func-failures"
      + resource_group_name      = "nl-prod-hov-rg-san"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "Http5xx"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.monitoring.azurerm_monitor_metric_alert.webapp_response_time[0] will be created
  + resource "azurerm_monitor_metric_alert" "webapp_response_time" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "webapp-slow-response"
      + resource_group_name      = "nl-prod-hov-rg-san"
      + scopes                   = (known after apply)
      + severity                 = 3
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HttpResponseTime"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.security.azurerm_key_vault.main will be updated in-place
  ~ resource "azurerm_key_vault" "main" {
        id                              = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
        name                            = "nl-prod-hov-kv-san"
        tags                            = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Hans Jurgens Smit"
            "Project"     = "House of Veritas"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              + "20.169.77.227",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.security.azurerm_key_vault_secret.baserow_secret_key will be created
  + resource "azurerm_key_vault_secret" "baserow_secret_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + name                    = "baserow-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.security.azurerm_key_vault_secret.db_password will be created
  + resource "azurerm_key_vault_secret" "db_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + name                    = "db-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.security.azurerm_key_vault_secret.docuseal_secret_key will be created
  + resource "azurerm_key_vault_secret" "docuseal_secret_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + name                    = "docuseal-secret-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.security.azurerm_key_vault_secret.smtp_password will be created
  + resource "azurerm_key_vault_secret" "smtp_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + name                    = "smtp-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage.azurerm_storage_account.main will be updated in-place
  ~ resource "azurerm_storage_account" "main" {
        id                                = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.Storage/storageAccounts/nlprodhovstsan"
        name                              = "nlprodhovstsan"
        tags                              = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Owner"       = "Hans Jurgens Smit"
            "Project"     = "House of Veritas"
        }
        # (42 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              + "20.169.77.227",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage.azurerm_storage_container.asset-uploads will be created
  + resource "azurerm_storage_container" "asset-uploads" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "asset-uploads"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "nlprodhovstsan"
    }

  # module.storage.azurerm_storage_container.backups will be created
  + resource "azurerm_storage_container" "backups" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "backups"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "nlprodhovstsan"
    }

  # module.storage.azurerm_storage_container.documents will be created
  + resource "azurerm_storage_container" "documents" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "documents"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "nlprodhovstsan"
    }

  # module.storage.azurerm_storage_container.terraform-state will be created
  + resource "azurerm_storage_container" "terraform-state" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "tfstate"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "nlprodhovstsan"
    }

  # module.webapp.azurerm_key_vault_access_policy.webapp will be created
  + resource "azurerm_key_vault_access_policy" "webapp" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/22f9eb18-6553-4b7d-9451-47d0195085fe/resourceGroups/nl-prod-hov-rg-san/providers/Microsoft.KeyVault/vaults/nl-prod-hov-kv-san"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # module.webapp.azurerm_linux_web_app.main will be created
  + resource "azurerm_linux_web_app" "main" {
      + app_settings                                   = {
          + "AZURE_STORAGE_CONNECTION_STRING" = (sensitive value)
          + "BASEROW_TOKEN"                   = (sensitive value)
          + "BASEROW_URL"                     = "https://ops.nexamesh.ai"
          + "DOCUMENT_INTELLIGENCE_ENDPOINT"  = "https://nl-prod-hov-di-san.cognitiveservices.azure.com/"
          + "DOCUMENT_INTELLIGENCE_KEY"       = (sensitive value)
          + "DOCUSEAL_KEY"                    = (sensitive value)
          + "DOCUSEAL_URL"                    = "https://docs.nexamesh.ai"
          + "JWT_SECRET"                      = (sensitive value)
          + "NEXT_PUBLIC_APP_URL"             = "https://nexamesh.ai"
          + "NODE_ENV"                        = "production"
          + "WEBSITE_NODE_DEFAULT_VERSION"    = "~20"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "southafricanorth"
      + name                                           = "nl-prod-hov-app-san"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "nl-prod-hov-rg-san"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }

          + cors {
              + allowed_origins     = [
                  + "https://docs.nexamesh.ai",
                  + "https://nexamesh.ai",
                  + "https://ops.nexamesh.ai",
                ]
              + support_credentials = false
            }
        }
    }

  # module.webapp.azurerm_service_plan.webapp will be created
  + resource "azurerm_service_plan" "webapp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "southafricanorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "nl-prod-hov-app-san-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "nl-prod-hov-rg-san"
      + sku_name                     = "B1"
      + tags                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Hans Jurgens Smit"
          + "Project"     = "House of Veritas"
        }
      + worker_count                 = (known after apply)
    }

Plan: 41 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + application_gateway_public_ip  = (known after apply)
  + baserow_container_id           = (known after apply)
  + database_server_fqdn           = (known after apply)
  + docuseal_container_id          = (known after apply)
  + function_app_hostname          = (known after apply)
  + function_app_url               = (known after apply)
  + web_app_hostname               = (known after apply)
  + web_app_url                    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @JustAGhosT, Action: `pull_request`*